from src.constants import SAMPLE_CONSTANT
import os
from src.structure import structure


def main() -> None:
    """
    Обязательнная составляющая программ, которые сдаются. Является точкой входа в приложение
    :return: Данная функция ничего не возвращает
    """

    structure()


if __name__ == "__main__":
    main()

# Добавить абс путь к копированию и для объекта, который копируем, и куда копируем. Для mv тоже самое
# Исправить недочет, если пользователь вводит абс путь, то конвертировать его сразу помощью pathlib.Path()
# Добавить поддержку абс пути для всех функций
